package main

import "fmt"

func main() {
	a := 5 // Переменная содержит количество товара

	goodsCount := 5

	dayForPayment := 3

	fmt.Println(a, goodsCount, dayForPayment)

}

/*  Что самого важного в коде?
1. 	Код должен выполнять требования.
2.	Код должен быть безопасным.
3.	Код должен быть понятным и поддерживаемым.
4.	Код должен быть тестируемым.
5.	Код должен быть эффективным и производительным.
6.	Код должен следовать стандартам и лучшим практикам.
*/

// Называйте переменные осмысленно. Чтобы было понятно, что она хранит, для чего она создавалась.
// В переменных можно использовать буквы, цифры (но не первой), знаки подчёркивания

// Старайтесь называть коротко, но осмысленно, информативно
// Очень важно, чтобы у вас был один единый стиль

// camelCase
